{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "Input-Token", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "name": "Input-Token"}, "inbound_nodes": []}, {"name": "Input-Segment", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "name": "Input-Segment"}, "inbound_nodes": []}, {"name": "Embedding-Token", "class_name": "Embedding", "config": {"name": "Embedding-Token", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 13584, "output_dim": 768, "embeddings_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "inbound_nodes": [[["Input-Token", 0, 0, {}]]]}, {"name": "Embedding-Segment", "class_name": "Embedding", "config": {"name": "Embedding-Segment", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 768, "embeddings_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["Input-Segment", 0, 0, {}]]]}, {"name": "Embedding-Token-Segment", "class_name": "Add", "config": {"name": "Embedding-Token-Segment", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Embedding-Token", 0, 0, {}], ["Embedding-Segment", 0, 0, {}]]]}, {"name": "Embedding-Position", "class_name": "PositionEmbedding", "config": {"name": "Embedding-Position", "trainable": true, "dtype": "float32", "input_dim": 512, "output_dim": 768, "merge_mode": "add", "embeddings_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "custom_position_ids": false}, "inbound_nodes": [[["Embedding-Token-Segment", 0, 0, {}]]]}, {"name": "Embedding-Norm", "class_name": "LayerNormalization", "config": {"name": "Embedding-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Embedding-Position", 0, 0, {}]]]}, {"name": "Embedding-Dropout", "class_name": "Dropout", "config": {"name": "Embedding-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Embedding-Norm", 0, 0, {}]]]}, {"name": "Attention-UniLM-Mask", "class_name": "Lambda", "config": {"name": "Attention-UniLM-Mask", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAUAAABTAAAAc1oAAAB0AGoBfABkAWQCjQJ9AXwBZABkAIUCZABkAGQAhQJm\nAxkAfAFkAGQAhQJkAGQAhQJkAGYDGQBrAX0CdACgAnwCdACgA6EAoQJ9AnwCZABkAIUCZABmAhkA\nUwApA07pAQAAACkB2gRheGlzKQTaAUvaBmN1bXN1bdoEY2FzdNoGZmxvYXR4KQPaAXPaBGlkeHPa\nBG1hc2upAHIKAAAA+jxGOlxzb2Z0d2FyZVxhbmFjb25kYTNcbGliXHNpdGUtcGFja2FnZXNcYmVy\ndDRrZXJhc1xtb2RlbHMucHnaCnVuaWxtX21hc2tHAQAAcwgAAAAAAQ4BLAEQAQ==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["Input-Segment", 0, 0, {}]]]}, {"name": "Transformer-0-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Transformer-0-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "heads": 12, "head_size": 64, "out_dim": 768, "key_size": 64, "use_bias": true, "attention_scale": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Embedding-Dropout", 0, 0, {"a_mask": true}], ["Embedding-Dropout", 0, 0, {"a_mask": true}], ["Embedding-Dropout", 0, 0, {"a_mask": true}], ["Attention-UniLM-Mask", 0, 0, {"a_mask": true}]]]}, {"name": "Transformer-0-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-0-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-0-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Transformer-0-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Transformer-0-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Embedding-Dropout", 0, 0, {}], ["Transformer-0-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Transformer-0-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-0-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-0-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Transformer-0-FeedForward", "class_name": "FeedForward", "config": {"name": "Transformer-0-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": ["gelu_erf"], "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-0-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Transformer-0-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-0-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-0-FeedForward", 0, 0, {}]]]}, {"name": "Transformer-0-FeedForward-Add", "class_name": "Add", "config": {"name": "Transformer-0-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-0-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Transformer-0-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Transformer-0-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-0-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-0-FeedForward-Add", 0, 0, {}]]]}, {"name": "Transformer-1-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Transformer-1-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "heads": 12, "head_size": 64, "out_dim": 768, "key_size": 64, "use_bias": true, "attention_scale": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-0-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-0-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-0-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Attention-UniLM-Mask", 0, 0, {"a_mask": true}]]]}, {"name": "Transformer-1-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-1-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-1-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Transformer-1-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Transformer-1-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-0-FeedForward-Norm", 0, 0, {}], ["Transformer-1-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Transformer-1-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-1-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-1-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Transformer-1-FeedForward", "class_name": "FeedForward", "config": {"name": "Transformer-1-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": ["gelu_erf"], "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-1-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Transformer-1-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-1-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-1-FeedForward", 0, 0, {}]]]}, {"name": "Transformer-1-FeedForward-Add", "class_name": "Add", "config": {"name": "Transformer-1-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-1-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Transformer-1-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Transformer-1-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-1-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-1-FeedForward-Add", 0, 0, {}]]]}, {"name": "Transformer-2-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Transformer-2-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "heads": 12, "head_size": 64, "out_dim": 768, "key_size": 64, "use_bias": true, "attention_scale": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-1-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-1-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-1-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Attention-UniLM-Mask", 0, 0, {"a_mask": true}]]]}, {"name": "Transformer-2-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-2-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-2-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Transformer-2-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Transformer-2-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-1-FeedForward-Norm", 0, 0, {}], ["Transformer-2-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Transformer-2-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-2-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-2-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Transformer-2-FeedForward", "class_name": "FeedForward", "config": {"name": "Transformer-2-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": ["gelu_erf"], "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-2-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Transformer-2-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-2-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-2-FeedForward", 0, 0, {}]]]}, {"name": "Transformer-2-FeedForward-Add", "class_name": "Add", "config": {"name": "Transformer-2-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-2-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Transformer-2-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Transformer-2-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-2-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-2-FeedForward-Add", 0, 0, {}]]]}, {"name": "Transformer-3-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Transformer-3-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "heads": 12, "head_size": 64, "out_dim": 768, "key_size": 64, "use_bias": true, "attention_scale": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-2-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-2-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-2-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Attention-UniLM-Mask", 0, 0, {"a_mask": true}]]]}, {"name": "Transformer-3-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-3-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-3-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Transformer-3-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Transformer-3-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-2-FeedForward-Norm", 0, 0, {}], ["Transformer-3-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Transformer-3-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-3-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-3-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Transformer-3-FeedForward", "class_name": "FeedForward", "config": {"name": "Transformer-3-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": ["gelu_erf"], "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-3-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Transformer-3-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-3-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-3-FeedForward", 0, 0, {}]]]}, {"name": "Transformer-3-FeedForward-Add", "class_name": "Add", "config": {"name": "Transformer-3-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-3-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Transformer-3-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Transformer-3-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-3-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-3-FeedForward-Add", 0, 0, {}]]]}, {"name": "Transformer-4-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Transformer-4-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "heads": 12, "head_size": 64, "out_dim": 768, "key_size": 64, "use_bias": true, "attention_scale": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-3-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-3-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-3-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Attention-UniLM-Mask", 0, 0, {"a_mask": true}]]]}, {"name": "Transformer-4-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-4-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-4-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Transformer-4-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Transformer-4-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-3-FeedForward-Norm", 0, 0, {}], ["Transformer-4-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Transformer-4-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-4-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-4-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Transformer-4-FeedForward", "class_name": "FeedForward", "config": {"name": "Transformer-4-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": ["gelu_erf"], "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-4-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Transformer-4-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-4-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-4-FeedForward", 0, 0, {}]]]}, {"name": "Transformer-4-FeedForward-Add", "class_name": "Add", "config": {"name": "Transformer-4-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-4-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Transformer-4-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Transformer-4-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-4-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-4-FeedForward-Add", 0, 0, {}]]]}, {"name": "Transformer-5-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Transformer-5-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "heads": 12, "head_size": 64, "out_dim": 768, "key_size": 64, "use_bias": true, "attention_scale": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-4-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-4-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-4-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Attention-UniLM-Mask", 0, 0, {"a_mask": true}]]]}, {"name": "Transformer-5-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-5-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-5-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Transformer-5-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Transformer-5-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-4-FeedForward-Norm", 0, 0, {}], ["Transformer-5-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Transformer-5-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-5-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-5-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Transformer-5-FeedForward", "class_name": "FeedForward", "config": {"name": "Transformer-5-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": ["gelu_erf"], "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-5-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Transformer-5-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-5-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-5-FeedForward", 0, 0, {}]]]}, {"name": "Transformer-5-FeedForward-Add", "class_name": "Add", "config": {"name": "Transformer-5-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-5-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Transformer-5-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Transformer-5-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-5-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-5-FeedForward-Add", 0, 0, {}]]]}, {"name": "Transformer-6-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Transformer-6-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "heads": 12, "head_size": 64, "out_dim": 768, "key_size": 64, "use_bias": true, "attention_scale": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-5-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-5-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-5-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Attention-UniLM-Mask", 0, 0, {"a_mask": true}]]]}, {"name": "Transformer-6-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-6-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-6-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Transformer-6-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Transformer-6-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-5-FeedForward-Norm", 0, 0, {}], ["Transformer-6-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Transformer-6-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-6-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-6-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Transformer-6-FeedForward", "class_name": "FeedForward", "config": {"name": "Transformer-6-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": ["gelu_erf"], "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-6-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Transformer-6-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-6-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-6-FeedForward", 0, 0, {}]]]}, {"name": "Transformer-6-FeedForward-Add", "class_name": "Add", "config": {"name": "Transformer-6-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-6-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Transformer-6-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Transformer-6-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-6-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-6-FeedForward-Add", 0, 0, {}]]]}, {"name": "Transformer-7-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Transformer-7-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "heads": 12, "head_size": 64, "out_dim": 768, "key_size": 64, "use_bias": true, "attention_scale": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-6-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-6-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-6-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Attention-UniLM-Mask", 0, 0, {"a_mask": true}]]]}, {"name": "Transformer-7-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-7-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-7-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Transformer-7-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Transformer-7-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-6-FeedForward-Norm", 0, 0, {}], ["Transformer-7-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Transformer-7-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-7-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-7-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Transformer-7-FeedForward", "class_name": "FeedForward", "config": {"name": "Transformer-7-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": ["gelu_erf"], "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-7-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Transformer-7-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-7-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-7-FeedForward", 0, 0, {}]]]}, {"name": "Transformer-7-FeedForward-Add", "class_name": "Add", "config": {"name": "Transformer-7-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-7-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Transformer-7-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Transformer-7-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-7-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-7-FeedForward-Add", 0, 0, {}]]]}, {"name": "Transformer-8-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Transformer-8-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "heads": 12, "head_size": 64, "out_dim": 768, "key_size": 64, "use_bias": true, "attention_scale": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-7-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-7-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-7-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Attention-UniLM-Mask", 0, 0, {"a_mask": true}]]]}, {"name": "Transformer-8-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-8-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-8-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Transformer-8-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Transformer-8-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-7-FeedForward-Norm", 0, 0, {}], ["Transformer-8-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Transformer-8-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-8-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-8-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Transformer-8-FeedForward", "class_name": "FeedForward", "config": {"name": "Transformer-8-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": ["gelu_erf"], "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-8-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Transformer-8-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-8-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-8-FeedForward", 0, 0, {}]]]}, {"name": "Transformer-8-FeedForward-Add", "class_name": "Add", "config": {"name": "Transformer-8-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-8-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Transformer-8-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Transformer-8-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-8-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-8-FeedForward-Add", 0, 0, {}]]]}, {"name": "Transformer-9-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Transformer-9-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "heads": 12, "head_size": 64, "out_dim": 768, "key_size": 64, "use_bias": true, "attention_scale": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-8-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-8-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-8-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Attention-UniLM-Mask", 0, 0, {"a_mask": true}]]]}, {"name": "Transformer-9-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-9-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-9-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Transformer-9-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Transformer-9-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-8-FeedForward-Norm", 0, 0, {}], ["Transformer-9-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Transformer-9-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-9-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-9-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Transformer-9-FeedForward", "class_name": "FeedForward", "config": {"name": "Transformer-9-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": ["gelu_erf"], "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-9-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Transformer-9-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-9-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-9-FeedForward", 0, 0, {}]]]}, {"name": "Transformer-9-FeedForward-Add", "class_name": "Add", "config": {"name": "Transformer-9-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-9-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Transformer-9-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Transformer-9-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-9-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-9-FeedForward-Add", 0, 0, {}]]]}, {"name": "Transformer-10-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Transformer-10-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "heads": 12, "head_size": 64, "out_dim": 768, "key_size": 64, "use_bias": true, "attention_scale": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-9-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-9-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-9-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Attention-UniLM-Mask", 0, 0, {"a_mask": true}]]]}, {"name": "Transformer-10-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-10-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-10-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Transformer-10-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Transformer-10-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-9-FeedForward-Norm", 0, 0, {}], ["Transformer-10-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Transformer-10-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-10-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-10-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Transformer-10-FeedForward", "class_name": "FeedForward", "config": {"name": "Transformer-10-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": ["gelu_erf"], "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-10-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Transformer-10-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-10-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-10-FeedForward", 0, 0, {}]]]}, {"name": "Transformer-10-FeedForward-Add", "class_name": "Add", "config": {"name": "Transformer-10-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-10-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Transformer-10-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Transformer-10-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-10-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-10-FeedForward-Add", 0, 0, {}]]]}, {"name": "Transformer-11-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Transformer-11-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "heads": 12, "head_size": 64, "out_dim": 768, "key_size": 64, "use_bias": true, "attention_scale": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-10-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-10-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Transformer-10-FeedForward-Norm", 0, 0, {"a_mask": true}], ["Attention-UniLM-Mask", 0, 0, {"a_mask": true}]]]}, {"name": "Transformer-11-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-11-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-11-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Transformer-11-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Transformer-11-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-10-FeedForward-Norm", 0, 0, {}], ["Transformer-11-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Transformer-11-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-11-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-11-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Transformer-11-FeedForward", "class_name": "FeedForward", "config": {"name": "Transformer-11-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": ["gelu_erf"], "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-11-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Transformer-11-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-11-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-11-FeedForward", 0, 0, {}]]]}, {"name": "Transformer-11-FeedForward-Add", "class_name": "Add", "config": {"name": "Transformer-11-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-11-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Transformer-11-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Transformer-11-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-11-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-11-FeedForward-Add", 0, 0, {}]]]}, {"name": "Pooler", "class_name": "Lambda", "config": {"name": "Pooler", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcxAAAAB8AGQAZACFAmQBZgIZAFMAKQJO6QAAAACpACkB2gF4\ncgIAAAByAgAAAPo8Rjpcc29mdHdhcmVcYW5hY29uZGEzXGxpYlxzaXRlLXBhY2thZ2VzXGJlcnQ0\na2VyYXNcbW9kZWxzLnB52gg8bGFtYmRhPjACAADzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["Transformer-11-FeedForward-Norm", 0, 0, {}]]]}, {"name": "Pooler-Dense", "class_name": "Dense", "config": {"name": "Pooler-Dense", "trainable": true, "dtype": "float32", "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Pooler", 0, 0, {}]]]}], "input_layers": [["Input-Token", 0, 0], ["Input-Segment", 0, 0]], "output_layers": [["Pooler-Dense", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}